app/controllers/listings_controller.rb

    def create
        #finish logic for creating a record
        @listing = current_user.listings.create(listing_params)
---
INSERT INTO "listings" ("title", "description", "breed_id", "sex", "price", "deposit", "date_of_birth", "diet", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def update
        @listing = Listing.update(params["id"], listing_params)
---
UPDATE "listings" SET "updated_at" = $1 WHERE "listings"."id" = $2  [["updated_at", "2020-04-28 01:30:46.149671"], ["id", 2]]

    def destroy
        Listing.find(params[:id]).destroy
---
DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 1]]
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_user_listing
        @listing = current_user.listings.find_by_id(params[:id])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."user_id" = $1 AND "listings"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]

    def set_breeds_and_sexes
        @breeds = Breed.all
---
SELECT "breeds".* FROM "breeds"